      ******************************************************************
      * Author:JOSE ANTONIO DUARTE JR.80x25
      * Date:02/02/2021
      * Purpose:COBOL PARA MICROCOMPUTADORES EXERCICIO:15 PAG:169
      * Tectonics: cobc
      * Objetivo: RELATORIO CLASSIFICADO POR CAMPO
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXER151.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADPROD ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS WS-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  CADPROD
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS "CADPROD".
       01  REG-CADPROD.
           02 FD-CODIGO-PRODUTO      PIC 9(05)       VALUE ZEROS.
           02 FD-NOME-PRODUTO        PIC X(25)       VALUE SPACES.
           02 FD-LIMITE-SUPER        PIC 9(05)       VALUE ZEROS.
           02 FD-LIMITE-INFER        PIC 9(05)       VALUE ZEROS.
           02 FD-PRECO-UNIT          PIC 9(05)V99    VALUE ZEROS.
           02 FD-QTDADE-ESTOQUE      PIC 9(05)       VALUE ZEROS.
       WORKING-STORAGE SECTION.
           77  CONFIRMA PIC X(01) VALUE SPACES.
           77  WS-STATUS PIC X(02) VALUE SPACES.
       SCREEN SECTION.
       01  LIMPA-TELA.
           02 BLANK SCREEN.
       01  TELA-BASE.
           02 LINE 01 COLUMN 02
           VALUE "PROGRAMA QUE GERA E POPULA CADPROD".
           02 LINE 03 COLUMN 02 VALUE "CODIGO:".
           02 LINE 04 COLUMN 02 VALUE "NOME DO PRODUTO:".
           02 LINE 05 COLUMN 02 VALUE "LIMITE SUPERIOR:".
           02 LINE 06 COLUMN 02 VALUE "LIMITE INFERIOR:".
           02 LINE 07 COLUMN 02 VALUE "PRECO UNITARIO:".
           02 LINE 08 COLUMN 02 VALUE "QTDADE ESTOQUE:".
       PROCEDURE DIVISION.
       INICIO.
           OPEN OUTPUT CADPROD.
       GRAVA-DADOS.
           DISPLAY LIMPA-TELA.
           DISPLAY TELA-BASE.
           ACCEPT FD-CODIGO-PRODUTO AT 0320.
           ACCEPT FD-NOME-PRODUTO   AT 0420.
           ACCEPT FD-LIMITE-SUPER   AT 0520.
           ACCEPT FD-LIMITE-INFER   AT 0620.
           ACCEPT FD-PRECO-UNIT     AT 0720.
           ACCEPT FD-QTDADE-ESTOQUE AT 0820.
           ACCEPT CONFIRMA AT 0917.
           WRITE REG-CADPROD.
           DISPLAY "PARA DE INSERIR ? S-SIM" AT 1002.
           ACCEPT CONFIRMA AT 1026.
           IF CONFIRMA = "S"
               CLOSE CADPROD
               DISPLAY "ARQUIVO GERADO E GRAVADO SAINDO" AT 1102
               ACCEPT CONFIRMA AT 1134
               STOP RUN
           ELSE
               GO TO GRAVA-DADOS.
       END PROGRAM EXER151.
